package com.mall.common;/**
 * ${author} on 2018/9/17.
 */

import java.util.HashMap;
import java.util.Map;

/**
 * @author zhangxiaolu
 * @描述
 * @since 2018/9/17 18:26
 */
public class Constants {
    public static Map<Long, String> SESSION_KEY_MAP = new HashMap<>();

    public static String PROTOCAL="乐拼GO本地生活服务电商平台商家入驻服务协议\n"+
            "为了更好地为商家服务以及保障消费者权益，甲、乙双方本着平等合作、互惠互利的原则，在符合国家相关法律法规，不违反市场竞争的情况下，甲方须遵循乙方的运营管理规范，经友好协商，甲、乙双方签署以下入驻协议。\n"+
            "\n"+
            "一、合作内容\n"+
            "1、甲方提供微信小程序平台，供乙方发布其相关产品的拼团信息。\n"+
            "2、本协议自乙方向甲方平台提交入驻申请，在甲方审核通过后，即刻生效，具备法律效力。\n"+
            "\n"+
            "二、甲方权利与义务\n"+
            "1、甲方为乙方提供微信小程序平台的网络宣传和相关服务。\n"+
            "2、甲方为乙方在消费群体中做相关宣传并协助推广，以提升乙方的知名度。\n"+
            "3、凡甲方已经在乙方上线的产品信息及相应服务内容，在双方规定的上线时间内，未经乙方同意甲方不得进行任何形式直接或间接的取消或变更，如因特殊原因甲方确实需要进行变更或取消的，由甲方至少提前5个工作日告知乙方，并由双方另行商议对页面做出相应的调整后方可进行变更。\n"+
            "4、如乙方提供产品信息有不符合国家规定的食品安全、环保标准或其他相关行业行为规范的情况，甲方有权随时告知解除本合同，并强制将乙方产品下线，由此产生的损失，甲方不承担任何法律责任和经济补偿。\n"+
            "5、乙方在甲方平台发生的订单交易问题和乙方提现申请问题，甲方有义务处理并结算，保证乙方资金安全。\n"+
            "6、因乙方与用户之间发生的投诉或者其他纠纷等问题，并由此产生的经济赔偿，由甲方协助乙方及时处理。\n"+
            "7、甲方不对乙方所发布信息的删除或储存失败负责。甲方有判定乙方的行为是否符合甲方服务条款的要求和精神的保留权利，如果乙方违背了服务条款的规定，甲方有中断对其提供网络服务的权利。\n"+
            "8、如因不可抗力或其他无法控制的因素，导致甲方销售系统崩溃或无法正常使用，由此发生的网上交易无法完成或丢失有关的信息、记录等，甲方不承担责任。但是甲方会尽可能合理地协助处理善后事宜，并努力使各方免受经济损失。\n"+
            "\n"+
            "三、乙方权利与义务\n"+
            "1、乙方应提供被国家工商、税务等部门认可的单位资质证明，因乙方资质问题导致本协议无法正常履行的结果由乙方负责。\n"+
            "2、乙方应遵循本行业相关法律法规和条例，并保证自身具备提供本合同项下产品及履行本合同项下乙方产品服务的必要的资质批文、管理制度及合格人员，保证产品质量，安全、无污染。\n"+
            "3、乙方一旦注册成功，成为本站的合法商家，将得到一个用户名和密码，并可随时根据平台指示改变密码。乙方应对自身用户名和密码的安全负全部责任。另外，每个商家都要对以其用户名进行的所有活动和事件负全责。乙方若发现任何非法使用用户帐户或存在安全漏洞的情况，请立即通告甲方。\n"+
            "4、乙方应根据平台发布信息承诺条款应如实履行，如消费者投诉乙方承诺不如实履行，甲方有权将乙方在平台资金赔付给用户。\n"+
            "5、如用户要求开具发票等有效凭证，由乙方负责提供。\n"+
            "6、甲方系统通知乙方下单后，如乙方因产品售罄或其他原因不能及时提供，乙方应立即电话通知下单的消费者和甲方，并做好合理的安抚和处理。\n"+
            "7、乙方在收到用户退订申请后，甲方监督乙方按约定及时处理。\n"+
            "8、乙方自行负责商业项目过程中的一切安全问题，甲方概不负责。\n"+
            "9、乙方严禁在甲方平台上发布黄、赌、毒、邪教等不健康信息，不得在甲方平台发布违反法律规定的产品信息或者言论，造成的法律后果由乙方自行承担，甲方有权终止协议并清退乙方。\n"+
            "10、乙方未按照约定及时处理用户退款、投诉等问题，除给予用户的正常的赔偿以外，还要承担违约责任并向甲方支付违约金，违约金按照用户实际损失的30%计算。\n"+
            "\n"+
            "四、合作约定\n"+
            "1、双方的品牌归各自所有。甲、乙双方均不可在对方未经授权的情况下使用对方名称、LOGO以及涉及相关内容的销售、促销宣传材料及广告、报纸、杂志、宣传单等。如因此产生的不良后果及损失由违约方自行全部承担。\n"+
            "2、任何双方违反本协议所规定的义务导致另一方受到包括但不限于投诉、举报、诉讼或处罚、赔偿等损失，违约方在收到守约方要求纠正其违法行为的书面通知之日，应立即停止其违约行为，并在10日内赔偿守约方因此受到的损失。\n"+
            "3、本协议任何一方均应对其获得对方的业务、经营、财务状况和其他保密资料予以严格保密，不得以任何形式向任何第三方披露。如因任何一方未能履行保密义务而给其他方造成任何损失的，应承担赔偿责任。\n"+
            "4、甲方为乙方提供宣传所用的物料包，乙方需要支付相关的费用。\n"+
            "5、甲方可提供促销、引流、推广等增值服务。乙方如需定制，需支付相应费用，具体须签订补充协议。\n"+
            "6、乙方应向甲方缴纳规定数额的保证金，甲方应为乙方妥善保管好保证金，必要时可用于支付用户赔偿金。\n"+
            "\n"+
            "五、争议解决\n"+
            "本协议项下争议由双方友好协商解决，无法达成一致情形，任何一方有权将整体提交至甲方所在地人民法院诉讼解决。\n"+
            "\n"+
            "六、费用结算\n"+
            "1、乙方在发布有价拼团活动中，拼团总额的10%作为服务费由甲方收取。\n"+
            "2、用户需要索取的发票等有效凭证由乙方负责开具，与甲方无关。\n"+
            "七、资金结算\n"+
            "1、乙方在用户订单核销完成后即可在线申请资金提现，平台系统在收到提现申请自动安排时间在7个工作日内处理乙方提现申请。\n"+
            "2、对于用户申请的正常退订，乙方在收到退订申请后，应于24小时内按约定做出退款处理，保证用户资金及时到账。\n";
}
